# Introduction-to-pandas
Series
The syntax is: pd.Series( data, index, dtype, copy)

In [ ]:
import pandas as pd
import numpy as np
data = np.array(['Test1','Test2','Test3'])
names = pd.Series(data)
print(names)

Create a series from array with index

In [6]:
data = np.array(['Tom','Jerry','Nick','Harry','Ruth','Gloria'])
names = pd.Series(data, index=[100,101,102,103,104,105])
print (names)

100       Tom
101     Jerry
102      Nick
103     Harry
104      Ruth
105    Gloria
dtype: object

Create a series from Dictionary

In [8]:
data = {
 'student' : ['Tom', 'Jerry', 'Gloria', 'Hillary'],
 'age' : [21, 34, 45, 67],
 'gender' : ['Male','Female', 'Female', 'Male']
 }
Student = pd.Series(data)
print (Student)

student    [Tom, Jerry, Gloria, Hillary]
age                     [21, 34, 45, 67]
gender      [Male, Female, Female, Male]
dtype: object



Create a Series from Scalar

In [11]:
score = pd.Series(10, index=['A','B','C'])
print (score)

A    10
B    10
C    10
dtype: int64

Accessing data from series with position

In [13]:
data = np.array([1,2,3,4,5])
position = pd.Series(data)
print(position[0])

1

# DataFrames
Those that have used R before can relate to this data structure as it was inspired by Râ€™s own dataframes. A dataframe can contain a Pandas DataFrame, Series, Numpy array or dictionaries of 1-dimensional.

In [19]:
data = {
 'name': ['Kwadwo', 'Nana', 'Kwame', 'Naa'],
 'age': [20, 19, 22, 21],
 'favorite_color': ['red', 'orange', 'green', 'purple'],
 'grade': [67, 78, 90, 12]
 }
df = pd.DataFrame(data)
print(df)

     name  age favorite_color  grade
0  Kwadwo   20            red     67
1    Nana   19         orange     78
2   Kwame   22          green     90
3     Naa   21         purple     12

In [20]:
df.columns

Index(['name', 'age', 'favorite_color', 'grade'], dtype='object')

In [21]:
df.values

array([['Kwadwo', 20, 'red', 67],
       ['Nana', 19, 'orange', 78],
       ['Kwame', 22, 'green', 90],
       ['Naa', 21, 'purple', 12]], dtype=object)

In [22]:
df.shape

(4, 4)

In [23]:
df.dtypes

name              object
age                int64
favorite_color    object
grade              int64
dtype: object

# Sorting
We can sort values in a dataframe by using one of its columns as the base. In this instrance we will sort values by age in an ascending order.

In [25]:
df.sort_values(by='age')

     name  age favorite_color  grade
1    Nana   19         orange     78
0  Kwadwo   20            red     67
3     Naa   21         purple     12
2   Kwame   22          green     90

Slicing

In [26]:
df[['age','grade']] #Display the age and grade columns only

   age  grade
0   20     67
1   19     78
2   22     90
3   21     12

Selection by label

In [27]:
df.loc[:2] #Display the first three rows

     name  age favorite_color  grade
0  Kwadwo   20            red     67
1    Nana   19         orange     78
2   Kwame   22          green     90

Selection by Position

In [28]:
df.iloc[3]

name                 Naa
age                   21
favorite_color    purple
grade                 12
Name: 3, dtype: object

# Summary Statistics

In [30]:
df['age'].mean() #Get the mean of the age column

20.5

In [31]:
df['age'].std() #Display the standard deviation

1.2909944487358056

In [33]:
df['age'].min()

19

In [34]:
df['age'].max()

22

In [35]:
df.describe()

             age      grade
count   4.000000   4.000000
mean   20.500000  61.750000
std     1.290994  34.471002
min    19.000000  12.000000
25%    19.750000  53.250000
50%    20.500000  72.500000
75%    21.250000  81.000000
max    22.000000  90.000000

# Importing and exporting data

In [37]:
data = pd.read_csv('student_data.csv')
print(data)

     admit  gre   gpa  rank
0        0  380  3.61     3
1        1  660  3.67     3
2        1  800  4.00     1
3        1  640  3.19     4
4        0  520  2.93     4
5        1  760  3.00     2
6        1  560  2.98     1
7        0  400  3.08     2
8        1  540  3.39     3
9        0  700  3.92     2
10       0  800  4.00     4
11       0  440  3.22     1
12       1  760  4.00     1
13       0  700  3.08     2
14       1  700  4.00     1
15       0  480  3.44     3
16       0  780  3.87     4
17       0  360  2.56     3
18       0  800  3.75     2
19       1  540  3.81     1
20       0  500  3.17     3
21       1  660  3.63     2
22       0  600  2.82     4
23       0  680  3.19     4
24       1  760  3.35     2
25       1  800  3.66     1
26       1  620  3.61     1
27       1  520  3.74     4
28       1  780  3.22     2
29       0  520  3.29     1
..     ...  ...   ...   ...
370      1  540  3.77     2
371      1  680  3.76     3
372      1  680  2.42     1
373      1  620  3.37     1
374      0  560  3.78     2
375      0  560  3.49     4
376      0  620  3.63     2
377      1  800  4.00     2
378      0  640  3.12     3
379      0  540  2.70     2
380      0  700  3.65     2
381      1  540  3.49     2
382      0  540  3.51     2
383      0  660  4.00     1
384      1  480  2.62     2
385      0  420  3.02     1
386      1  740  3.86     2
387      0  580  3.36     2
388      0  640  3.17     2
389      0  640  3.51     2
390      1  800  3.05     2
391      1  660  3.88     2
392      1  600  3.38     3
393      1  620  3.75     2
394      1  460  3.99     3
395      0  620  4.00     2
396      0  560  3.04     3
397      0  460  2.63     2
398      0  700  3.65     2
399      0  600  3.89     3

[400 rows x 4 columns]

Read more https://pandas.pydata.org/pandas-docs/version/0.22/cookbook.html#cookbook